# YOLOv9

# parameters
nc: 80  # number of classes

# gelan backbone
backbone:
  - [-1, 1, Silence, []]
  - [-1, 1, Conv, [64, 3, 2]]  # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 2-P2/4
  - [-1, 1, RepNCSPELAN4, [256, 128, 64, 2]]  # 3
  - [-1, 1, Conv, [256, 3, 2]]  # 4-P3/8 # 4-P3/8
  - [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]]  # 5
  - [-1, 1, Conv, [512, 3, 2]] # 6
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]  # 7
  - [-1, 1, Conv, [512, 3, 2]]  # 8-P5/32
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]  # 9
  - [-1, 1, SPPELAN, [512, 256]]# 10

# gelan head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P4
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]]  # 35 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]  # 38 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]  # 41 (P5/32-large)
  - [5, 1, CBLinear, [[256]]] # 23
  - [7, 1, CBLinear, [ [ 256, 512 ] ] ] # 24
  - [9, 1, CBLinear, [ [ 256, 512, 512 ] ] ] # 25

    # conv down
  - [0, 1, Conv, [ 64, 3, 2 ] ]  # 26-P1/2

    # conv down
  - [-1, 1, Conv, [ 128, 3, 2 ] ]  # 27-P2/4

    # elan-1 block
  - [ -1, 1, RepNCSPELAN4, [ 256, 128, 64, 1]]  # 28

    # conv down fuse
  - [-1, 1, Conv, [ 256, 3, 2 ] ]  # 29-P3/8
  - [[23, 24, 25, -1], 1, CBFuse, [[0, 0, 0]]] # 30

    # elan-2 block
  - [ -1, 1, RepNCSPELAN4, [ 512, 256, 128, 1 ] ]  # 31

    # conv down fuse
  - [ -1, 1, Conv, [ 512, 3, 2 ] ]  # 32-P4/16
  - [ [ 24, 25, -1 ], 1, CBFuse, [ [ 1, 1 ] ] ] # 33

    # elan-2 block
  - [ -1, 1, RepNCSPELAN4, [ 512, 512, 256, 1 ] ]  # 34

    # conv down fuse
  - [ -1, 1, Conv, [ 512, 3, 2 ] ]  # 35-P5/32
  - [ [ 25, -1 ], 1, CBFuse, [ [ 2 ] ] ] # 36

    # elan-2 block
  - [ -1, 1, RepNCSPELAN4, [ 512, 512, 256, 1 ] ]  # 37

   # detect
  - [[31, 34, 37, 16, 19, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5)
